/* DATA */

INSERT INTO `Storage` (`name`) VALUES
('Хранилище'),
('Читальный зал'),
('Выставочный зал');

INSERT INTO `Book` ( `ISBN`, `code`, `name`, `storage_id`) VALUES
('978-5-17-099842-5', 345432, 'На дне', 3),
('978-5-17-086689-2', 345467, 'Стена', 3),
('978-5-17-090790-5', 398067, 'Колыбельная', 1),
('978-5-9925-0159-9', 567867, 'La premiere enquete de maigret', 2),
('978-5-699-96119-5', 345433, 'Край обетованный', 3),
('978-5-17-112632-2', 349809, 'Мысли', 2),
('978-5-17-117348-7', 340998, 'Своя комната', 1),
('209-031824-4', 347875, 'L\'heure du crime', 2),
('978-5-17-107197-4', 357887, 'Голод', 1),
('978-5-17-098304-9', 876556, 'Иметь или не иметь', 1),
('978-5-17-097653-9', 367123, 'Старик и море', 1),
('978-5-17-080083-4', 367123, 'Чума', 1);

INSERT INTO `Author` ( `code`, `lastname`, `firstname`) VALUES
(2345, 'Хемингуэй', 'Эрнест'),
(2349, 'Камю', 'Альбер'),
(1454, 'Гамсун', 'Кнут'),
(7654, 'Renaud', 'Dominique'),
(1233, 'Вулф', 'Вирджиния'),
(3454, 'Паскаль', 'Блез'),
(5675, 'Мураками', 'Харуки'),
(9873, 'Simenon', 'Georges'),
(5432, 'Паланик', 'Чак'),
(5467, 'Жан Поль', 'Сартр'),
(5465, 'Горький', 'Максим');

INSERT INTO `Genre` (`code`, `name`) VALUES
(34, 'Драма'),
(37, 'Приключения'),
(33, 'Роман'),
(32, 'Новелла'),
(54, 'Фантастика'),
(13, 'Полицейский роман'),
(10, 'Публицистика'),
(55, 'Проза'),
(56, 'Философия');

INSERT INTO `Book_genre` (`book_id`, `genre_id`) VALUES
(11, 1),
(2, 4),
(3, 5),
(4, 6),
(5, 8),
(6, 9),
(7, 7),
(8, 6),
(9, 8),
(10, 8),
(11, 8),
(12, 8),
(12, 3);

INSERT INTO `Book_author` (`book_id`, `author_id`) VALUES
(1, 11),
(2, 10),
(3, 9),
(4, 8),
(5, 7),
(6, 6),
(7, 5),
(8, 4),
(9, 3),
(10, 1),
(11, 1),
(12, 2);

INSERT INTO `Reader` (`code`, `lastname`, `firstname`, `phone`, `adress`) VALUES
(1221, 'Обручев', 'Владимир', '+79041236558', 'ул. Байкальская, 234, 56'),
(1222, 'Крузенштерн', 'Иван', '+79042771461', 'ул. Сибирская, 53, 38'),
(1223, 'Лисин', 'Владимир', '+79040438991', 'ул. Трикотажный 9-й пер, 14, 366'),
(1224, 'Дерипаска', 'Олег', '+79049723531', 'ул. Магнитогорская, 35, 117'),
(1225, 'Вернадский', 'Владимир', '+79042867479', 'ул. Симферопольская, 64, 224'),
(1226, 'Лаптев', 'Дмитрий', '+79042231146', 'ул. Арбатский пер, 21, 246');

INSERT INTO `Order` (`taking_date`,`book_id`,`reader_id`,`expiration_date`,`status`) VALUES
('2020-06-01', 5, 4, '2020-06-15', 0),
('2020-06-01', 6, 4, '2020-06-15', 1),
('2020-06-01', 7, 4, '2020-06-15', 1),
('2020-06-04', 8, 3, '2020-06-18', 0),
('2020-06-05', 9, 3, '2020-06-18', 1),
('2020-06-06', 12, 1, '2020-06-20', 0),
('2020-06-07', 10, 2, '2020-06-21', 0),
('2020-06-09', 11, 5, '2020-06-23', 0),
('2020-06-08', 2, 6, '2020-06-22', 1),
('2020-05-10', 4, 1, '2020-05-24', 0),
('2020-05-09', 3, 4, '2020-05-23', 0),
('2020-05-08', 11, 3, '2020-05-22', 1),
('2020-05-08', 10, 3, '2020-05-22', 1),
('2020-04-06', 2, 4, '2020-04-20', 1);

